Revit 2024 API
ReferenceWithContext.GetInstanceTransform Method
 Gets the transform of the instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public Transform GetInstanceTransform()
Visual Basic
Public Function GetInstanceTransform As Transform
Visual C++
public:
Transform^ GetInstanceTransform()
Return Value
 The transform of an instance when the reference is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).
See Also
ReferenceWithContext Class
Autodesk.Revit.DB Namespace